rot13_api/app/controllers/encoder_controller.rb

INSERT INTO "original_strings" ("value", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"
---
  def encode
    begin
      original_string = OriginalString.create!(value: params[:string])